####################################################################################################
# 1) У вас есть переменная value, тип - int.
# Написать тернарный оператор для переменной new_value по такому правилу:
# если value меньше 100, то new_value равно половине значения value, в противном случае - противоположне value число.

value = 101

new_value = int(value / 2) if value < 100 else -value

print(type(value), value)
print(type(new_value), new_value)

####################################################################################################
# 2) У вас есть переменная value, тип - int.
# Написать тернарный оператор для переменной new_value по такому правилу:
# если value меньше 100, то new_value равно 1, в противном случае - 0.

value = 10

new_value = 1 if value < 100 else 0

print(type(value), value)
print(type(new_value), new_value)

####################################################################################################
# 3) У вас есть переменная value, тип - int.
# Написать тернарный оператор для переменной new_value по такому правилу:
# если value меньше 100, то new_value равно True, в противном случае - False.

value = 101

new_value = True if value < 100 else False

print(type(value), value)
print(type(new_value), new_value)

####################################################################################################
# 4) У вас есть переменная my_str, тип - str. Напечатать все символы, стоящие на четных местах (начиная с нуля).

my_str = "0123456789"

print(type(my_str), my_str[::2])

####################################################################################################
# 5) У вас есть переменная my_str, тип - str. Напечатать все символы, стоящие на "нечетных" местах (начиная с нуля).

my_str = "0123456789"

print(type(my_str), my_str[1::2])

####################################################################################################
# 6) У вас есть переменная my_str, тип - str.
# Если ее длинна меньше 5, то допишите в конец строки себя же.
# Пример: было - "qwer", стало - "qwerqwer". Если длинна не меньше 5, то оставить строку как есть.

my_str = "0123456789"
if len(my_str) < 5:
    my_str *= 2

print(type(my_str), my_str)

####################################################################################################
# 7) У вас есть переменная my_str, тип - str.
# Если ее длинна меньше 5, то допишите в конец строки перевернутую себя же.
# Пример: было - "qwer", стало - "qwerrewq". Если длинна не меньше 5, то оставить строку как есть.

my_str = "0123"
if len(my_str) < 5:
    my_str += my_str[::-1]

print(type(my_str), my_str)
